MyHome/src/Catalogs/мх_Номенклатура/мх_Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мх_Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.мх_ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

MyHome/src/Enums/мх_ТипыНоменклатуры/мх_ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>мх_ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Лекарство</name>
  </enumValues>
</mdclass:Enum>

MyHome/src/Catalogs/мх_Номенклатура/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ДляВызоваИзДругихПодсистем

Процедура ЗаполнитьТипНоменклатурыПоУмолчанию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	мх_Номенклатура.Ссылка
	|ИЗ
	|	Справочник.мх_Номенклатура КАК мх_Номенклатура
	|ГДЕ
	|	НЕ мх_Номенклатура.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипПоУмолчанию = Перечисления.мх_ТипыНоменклатуры.Товар;
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Тип = ТипПоУмолчанию;
		Объект.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти	

#КонецЕсли
